app/controllers/account_controller.rb

SELECT count(*) AS count_all FROM `users`
---
  def index
    redirect_to(:action => 'signup') unless logged_in? || User.count > 0

INSERT INTO `users` (`salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('92352657241eb554ce3320908a8a1e7eb43cbd15', '2009-01-28 00:18:01', '26c2570811daf87dd11fe45e8cce4a93426a2946', NULL, '2009-01-28 00:18:01', NULL, 'quire', 'quire@example.com')
---
  def signup
    @user = User.new(params[:user])
    return unless request.post?
    @user.save!