app/controllers/images_controller.rb

SELECT * FROM `images` WHERE (`images`.`parent_id` IS NULL) ORDER BY position, created_at DESC
---
  def index
    #this ensures that only the original images are chosen and excludes the thumbnails
    @images = Image.find(:all, :conditions=> {:parent_id => nil} , :order=>'created_at DESC')

SELECT * FROM `images` WHERE (`images`.`id` = 953125641)
---
  def show
    @image = Image.find(params[:id])

SELECT * FROM `images` WHERE (`images`.`id` = 953125641)
---
  def edit
    @image = Image.find(params[:id])

SELECT * FROM `images` WHERE (`images`.`id` = 953125641)
---
  def update
    @image = Image.find(params[:id])

SELECT * FROM `images` WHERE (`images`.`id` = 953125641)
DELETE FROM `images` WHERE `id` = 953125641
---
  def destroy
    @image = Image.find(params[:id])
    @image.destroy