app/controllers/posts_controller.rb

SELECT * FROM `posts` WHERE (`posts`.`id` = 953125641)
---
  def show
    @post = Post.find(params[:id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 953125641)
---
  def edit
    @post = Post.find(params[:id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 953125641)
---
  def update
    @post = Post.find(params[:id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 953125641)
DELETE FROM `posts` WHERE `id` = 953125641
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy