app/controllers/services_controller.rb

SELECT * FROM `services` WHERE (`services`.`id` = 953125641)
---
  def show
    @service = Service.find(params[:id])

SELECT * FROM `services` WHERE (`services`.`id` = 953125641)
---
  def edit
    @service = Service.find(params[:id])

INSERT INTO `services` (`price`, `created_at`, `title`, `tag_id`, `updated_at`, `description`) VALUES(NULL, '2009-01-26 22:26:42', NULL, NULL, '2009-01-26 22:26:42', NULL)
---
  def create
    @service = Service.new(params[:service])

    respond_to do |format|
      if @service.save

SELECT * FROM `services` WHERE (`services`.`id` = 953125641)
---
  def update
    @service = Service.find(params[:id])

SELECT * FROM `services` WHERE (`services`.`id` = 953125641)
DELETE FROM `services` WHERE `id` = 953125641
---
  def destroy
    @service = Service.find(params[:id])
    @service.destroy