app/controllers/stylists_controller.rb

SELECT * FROM `stylists` WHERE (`stylists`.`id` = 953125641)
---
  def show
    @stylist = Stylist.find(params[:id])

SELECT * FROM `stylists` WHERE (`stylists`.`id` = 953125641)
---
  def edit
    @stylist = Stylist.find(params[:id])

INSERT INTO `stylists` (`name`, `image_id`, `created_at`, `title`, `updated_at`, `bio`) VALUES(NULL, NULL, '2009-10-24 00:22:13', NULL, '2009-10-24 00:22:13', NULL)
---
  def create
    @stylist = Stylist.new(params[:stylist])

    respond_to do |format|
      if @stylist.save

SELECT * FROM `stylists` WHERE (`stylists`.`id` = 953125641)
---
  def update
    @stylist = Stylist.find(params[:id])

SELECT * FROM `stylists` WHERE (`stylists`.`id` = 953125641)
DELETE FROM `stylists` WHERE `id` = 953125641
---
  def destroy
    @stylist = Stylist.find(params[:id])
    @stylist.destroy