app/controllers/tags_controller.rb

SELECT * FROM `tags` WHERE (`tags`.`id` = 953125641)
---
  def show

    @tag = Tag.find(params[:id])

SELECT * FROM `tags` WHERE (`tags`.`id` = 953125641)
---
  def edit
    @tag = Tag.find(params[:id])

INSERT INTO `tags` (`name`, `created_at`, `updated_at`) VALUES(NULL, '2009-01-26 22:26:42', '2009-01-26 22:26:42')
---
  def create
    @tag = Tag.new(params[:tag])

    respond_to do |format|
      if @tag.save

SELECT * FROM `tags` WHERE (`tags`.`id` = 953125641)
---
  def update
    @tag = Tag.find(params[:id])

SELECT * FROM `tags` WHERE (`tags`.`id` = 953125641)
DELETE FROM `tags` WHERE `id` = 953125641
---
  def destroy
    @tag = Tag.find(params[:id])
    @tag.destroy